array []
1 - Data type 
2- statically allocated in memory 
list []

In [6]:
import numpy as np 

a= np.array([[1,2,3],[4,5,"6"]])
a

array([['1', '2', '3'],
       ['4', '5', '6']], dtype='<U11')

In [4]:
a.shape

(6,)

In [7]:
a.shape

(2, 3)

In [8]:
a.size

6

In [10]:
a.reshape(3,2)

array([['1', '2'],
       ['3', '4'],
       ['5', '6']], dtype='<U11')

In [11]:
a.reshape(6,1)

array([['1'],
       ['2'],
       ['3'],
       ['4'],
       ['5'],
       ['6']], dtype='<U11')

In [16]:
a.reshape(3,3)

array([['1', '2', '3'],
       ['4', '5', '6'],
       ['', '', '']], dtype='<U11')

In [14]:
a.resize(9,refcheck=False)

In [15]:
a

array(['1', '2', '3', '4', '5', '6', '', '', ''], dtype='<U11')

In [17]:
a = np.array([[0,1,2],[3,4,5],[6,7,8]])

In [18]:
a[1][1]

4

In [32]:
x=np.zeros(5)

In [33]:
x

array([0., 0., 0., 0., 0.])

In [36]:
x[0]= "10"

In [37]:
x

array([10.,  0.,  0.,  0.,  0.])

In [1]:
import pandas as pd

    Serires 
    DataFrame

In [41]:
s = pd.Series(np.array(["1",2,3,4,5]))

In [43]:
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: object

In [44]:
color=["pink", "white", "black", "blue"]
occurence = [20, 15, 6, 43]
S=pd.Series(occurence, index=color)

In [47]:
S

pink     20
white    15
black     6
blue     43
dtype: int64

In [48]:
listt = [['Jack', 34, 'Paris'], ['Thomas', 30, 'Roma'], 
       ['Alexandre', 16, 'New York']] 

df = pd.DataFrame(listt, columns =['name', 'age', 'city'])

In [49]:
df

        name  age      city
0       Jack   34     Paris
1     Thomas   30      Roma
2  Alexandre   16  New York

In [50]:
dictionary  = { 'name' : ['Jack', 'Thomas', 'Alexandre'],
    'age' : [34, 30, 16],
    'city' : ['Paris', 'Roma', 'New York']}

df = pd.DataFrame(dictionary)

In [51]:
df

        name  age      city
0       Jack   34     Paris
1     Thomas   30      Roma
2  Alexandre   16  New York

In [53]:
my_numpy_array=np.random.randn(3,4)
df=pd.DataFrame(my_numpy_array, columns=list("abcd"))

In [54]:
df

          a         b         c         d
0 -0.836984 -0.413673 -1.721547  1.638617
1  0.364403 -1.747935 -0.513638  1.114664
2 -1.081930 -0.345329 -0.048820 -0.193601

In [52]:
list("abcd")

['a', 'b', 'c', 'd']

In [55]:
df.to_csv("test.csv")

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      float64
 1   b       3 non-null      float64
 2   c       3 non-null      float64
 3   d       3 non-null      float64
dtypes: float64(4)
memory usage: 224.0 bytes

In [57]:
df.describe()

              a         b         c         d
count  3.000000  3.000000  3.000000  3.000000
mean  -0.518170 -0.835646 -0.761335  0.853226
std    0.774081  0.790804  0.863435  0.943672
min   -1.081930 -1.747935 -1.721547 -0.193601
25%   -0.959457 -1.080804 -1.117593  0.460531
50%   -0.836984 -0.413673 -0.513638  1.114664
75%   -0.236290 -0.379501 -0.281229  1.376640
max    0.364403 -0.345329 -0.048820  1.638617

In [2]:
df = pd.read_csv("Titanic-Dataset.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [5]:
df.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df_2 = df[["Name","Age"]]

In [16]:
#df_2 = df_2.set_index("Name")
df_2.head(1)

                          Age
Name
Braund, Mr. Owen Harris  22.0

In [20]:
df_2

                                                     Age
Name
Braund, Mr. Owen Harris                             22.0
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0
Heikkinen, Miss. Laina                              26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)        35.0
Allen, Mr. William Henry                            35.0
...                                                  ...
Montvila, Rev. Juozas                               27.0
Graham, Miss. Margaret Edith                        19.0
Johnston, Miss. Catherine Helen "Carrie"             NaN
Behr, Mr. Karl Howell                               26.0
Dooley, Mr. Patrick                                 32.0

[891 rows x 1 columns]

In [44]:
#index error
l = [1,2,3]
l[3]

IndexError: list index out of range

In [23]:
# Syntax
print"Hello

SyntaxError: EOL while scanning string literal (1451872423.py, line 2)

In [25]:
#ModuleNotFoundError

import Mohamed

ModuleNotFoundError: No module named 'Mohamed'

In [26]:
# Key Error
D1={'1':"aa", '2':"bb", '3':"cc"}
D1["4"]

KeyError: '4'

In [27]:
#IndentationError

if x == 5 :
print("Hello!")

IndentationError: expected an indented block (3252401405.py, line 4)

In [29]:
#ImportError
from numpy import ali

ImportError: cannot import name 'ali' from 'numpy' (C:\Users\aser\anaconda3\envs\Django\lib\site-packages\numpy\__init__.py)

In [34]:
# StopIteration
it = iter([1,2,3])
next(it)
next(it)
next(it)
next(it)

StopIteration:

In [35]:
# Type Error

"2" + 2

TypeError: can only concatenate str (not "int") to str

In [36]:
# Value Error

int("x")

ValueError: invalid literal for int() with base 10: 'x'

In [37]:
#NameError 
print(mohamed)

NameError: name 'mohamed' is not defined

In [39]:
#ZeroDivisionError
x = 100 /0

ZeroDivisionError: division by zero

In [40]:
#KeyboardInterrupt
x = input("Name: ")

KeyboardInterrupt: Interrupted by user

# Binary Search

In [45]:
def binary (listt , start , end , target):
    if end >= start :
        mid = start + (end-start) //2
        print(mid)
        
        if listt[mid] == target :
            return mid 
        
        elif listt[mid] > target :
            
            return binary(listt,start,mid-1,target)
        
        else :
            return binary(listt,mid+1,end,target)
    else:
        return "Target Not Found!"

In [49]:
listt = [1,2,3,4,5,6,7,8,564,65,4,654,50,231,55]
listt.sort()
listt

[1, 2, 3, 4, 4, 5, 6, 7, 8, 50, 55, 65, 231, 564, 654]

In [50]:
start = 0 
end = len(listt)-1
target = 55

In [51]:
binary(listt,start,end,target)

7
11
9
10

10

In [52]:
listt.index(55)

10

# Bubble Sort